Repository: ProzorroUKR/openprocurement.archivarius.core
Catalog: docs/source/locale/*/LC_MESSAGES/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Introduction
uk: Вступ

source: CDB Archiving means transfer of the completed procurement procedures to an archival database on a separate server --- CDB copies with read-only operations allowed and a separate endpoint.
uk: Архівування ЦБД полягає у перенесенні завершених процедур закупівлі до архівної бази на окремий сервер --- копії ЦБД з дозволеними лише операціями читання та окремою точкою доступу.

source: Elements that are going to be transferred to the archival database:
uk: До архівної бази переносяться:

source: 1. procurement procedures in terminal status (`complete`, `unsuccessful`, `cancelled`) after 100-day stay on the production database.
uk: 1. процедури закупівлі в термінальному статусі (`complete`, `unsuccessful`, `cancelled`) після 100 днів перебування в продуктивній базі.

source: 2. contracts in terminal status (`terminated`) after 100-day stay on the production base.
uk: 2. контракти в термінальному статусі (terminated) після 100 днів перебування в продуктивній базі.

source: 3. plans that had been modified 455 (365+90) days for the last time before archiving (`dateModified` field in the database).
uk: 3. плани, які модифікувалися раніше за 455 (365+90) днів до моменту архівування (поле в БД `dateModified`).

source: The public part of the procedure will be transferred into the public database of the archive, `Public Archive`; the private part of the procedure in the encrypted form will be put into the secret database of the archive, `Secret Archive`. Access to the archive database is possible in read-only mode, so elements transferred to the archival database can't be edited anymore. Archiving procedure is conducted weekly or on request.
uk: Публічна частина процедури потрапляє у публічну базу даних архіву, `Public Archive`, приватна частина процедури у зашифрованиму вигляді потрапляє у секретну базу даних архіву, `Secret Archive`. Перенесення до архівної бази закриває можливість будь-якого редагування. Доступ до архівної бази можливий лише в режимі читання. Процедура архівування проводиться щотижня або по потребі за запитом.

source: Getting archived resource from the sandbox
uk: Отримання з пісочниці заархівованого ресурсу

source: Let's try getting tender already archived from the sandbox:
uk: Спробуймо отримати заархівований раніше тендер з пісочниці:

source: The same getting procedure is valid for other resources: `plans` and `contracts`.
uk: Отримання інших ресурсів, `планів` і `контрактів` відбувається аналогічним чином.

source: Getting archived resource from the `Archivarius`
uk: Отримання заархівованих ресурсів з `Архіваріуса`

source: Let's try getting tender already archived from the archive:
uk: Спробуймо отримати заархівований раніше тендер з архіву:

source: Only public resource data are derived by the request above. Getting secret data can be retrieved and decrypted only in manual mode.
uk: Наведеним вище способом можна отримати лише публічні дані. Отримати і розшифрувати секретні дані можна лише у ручному режимі.
